Revit 2027 API
RebarContainerItem.BarTypeId Property
 The identifier of the rebar bar type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId BarTypeId { get; }
Public ReadOnly Property BarTypeId As ElementId
	Get
public:
property ElementId^ BarTypeId {
	ElementId^ get ();
}
member BarTypeId : ElementId with get
Property Value
ElementId
See Also
Reference
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace